import { Button } from '@/shared/ui';
import { ProjectComment } from './ProjectComment';

const comments = [
  {
    id: '1',
    author: 'evelone52',
    message:
      'Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетий',
    rating: 4.75,
  },
  {
    id: '2',
    author: 'pbiryuchev',
    message:
      'Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух',
    rating: 3.5,
  },
  {
    id: '3',
    author: 'abrikos',
    message:
      'Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но ',
    rating: 2.3,
  },
  {
    id: '4',
    author: 'pomidor',
    message:
      'Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, ноэто не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагменэто не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагменэто не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагменэто не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагменэто не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагменэто не совсем так. Его корни уходят в один фрагмент классической латыни 45 года н.э., то есть более двух тысячелетийсем так. Его корни уходят в один фрагмен ',
    rating: 4,
  },
];

export const ProjectComments = ({ projectId }: { projectId: string }) => {
  console.log(projectId);

  return (
    <div className="w-full max-w-[712px]">
      <p className="mb-1">Всего комментариев {comments.length ?? 0}</p>
      <ul className="flex flex-col gap-2 w-full">
        {comments.map(comment => (
          <li key={comment.id}>
            <ProjectComment comment={comment} />
          </li>
        ))}
      </ul>
      <div className="mt-4 flex justify-center">
        <Button variant="light" size="md" radius="md" className="w-[120px]">
          Загрузить еще
        </Button>
      </div>
    </div>
  );
};
